---
kind: method
id: M:Autodesk.Revit.DB.CategorySet.Contains(Autodesk.Revit.DB.Category)
source: html/97643703-451b-957e-e748-c6fdcd46b49d.htm
---
# Autodesk.Revit.DB.CategorySet.Contains Method

Tests for the existence of a category within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	Category item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Category`) - The category to be searched for.

## Returns
The Contains method returns True if the category is within the set, otherwise False.